# Pandas Tutorials

In [1]:
import pandas as pd

In [2]:
list1=[1,2,3,4,'data','','fg']
print(list1)

[1, 2, 3, 4, 'data', '', 'fg']

In [3]:
series=pd.Series(list1)
print(series)

0       1
1       2
2       3
3       4
4    data
5
6      fg
dtype: object

In [4]:
type(series)

pandas.core.series.Series

In [5]:
series2=pd.Series([1,2,3])
print(series2)

0    1
1    2
2    3
dtype: int64

In [6]:
empty=pd.Series([])
print(empty)

Series([], dtype: float64)

C:\Users\Appu\AppData\Local\Temp/ipykernel_2756/1319934057.py:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  empty=pd.Series([])

In [7]:
series3=pd.Series([1,2,3], index=['a','b',2])
print(series3)

a    1
b    2
2    3
dtype: int64

In [8]:
series3=pd.Series([1,2,3], index=['a','b',2], dtype=float)
print(series3)

a    1.0
b    2.0
2    3.0
dtype: float64

In [9]:
series3=pd.Series([1,2,3], index=['a','b',2], dtype=float, name='pandas tutorials')
print(series3)

a    1.0
b    2.0
2    3.0
Name: pandas tutorials, dtype: float64

In [10]:
scaler=pd.Series(0.5)
print(scaler)

0    0.5
dtype: float64

In [11]:
scaler=pd.Series(0.5, index=[1,2,3])
print(scaler)

1    0.5
2    0.5
3    0.5
dtype: float64

In [12]:
dic=pd.Series({'a':1, 'b':2})
print(dic)

a    1
b    2
dtype: int64

In [13]:
s4 = pd.Series([1,2,3,4])
print(s4)

0    1
1    2
2    3
3    4
dtype: int64

In [14]:
s4[0]

1

In [15]:
s4[3]

4

In [16]:
s4[0:3]

0    1
1    2
2    3
dtype: int64

In [17]:
max(s4)

4

In [18]:
min(s4)

1

In [19]:
s4[s4>2]

2    3
3    4
dtype: int64

In [20]:
s4

0    1
1    2
2    3
3    4
dtype: int64

In [21]:
s5=pd.Series([1,2,3,4])
s5

0    1
1    2
2    3
3    4
dtype: int64

In [22]:
s4 + s5

0    2
1    4
2    6
3    8
dtype: int64

In [23]:
s6=pd.Series([1,2,3,4,5])
s6

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [24]:
s7=pd.Series([5,1,7])
s7

0    5
1    1
2    7
dtype: int64

In [25]:
s6 + s7

0     6.0
1     3.0
2    10.0
3     NaN
4     NaN
dtype: float64

# data frame

In [26]:
import pandas as pd

In [27]:
emt = pd.DataFrame()
print(emt)

Empty DataFrame
Columns: []
Index: []

In [28]:
lst = ['a','b','c']
print(lst)

['a', 'b', 'c']

In [29]:
df = pd.DataFrame(lst)
print(df)

   0
0  a
1  b
2  c

In [30]:
df

   0
0  a
1  b
2  c

In [31]:
ls = [[1,2,3],[2,3,4],[4,5,6]]
ls

[[1, 2, 3], [2, 3, 4], [4, 5, 6]]

In [32]:
df2=pd.DataFrame(ls)
df2

   0  1  2
0  1  2  3
1  2  3  4
2  4  5  6

In [33]:
dict1={'ID':[11,22,33,44]}
dict1

{'ID': [11, 22, 33, 44]}

In [34]:
df3=pd.DataFrame(dict1)
df3

   ID
0  11
1  22
2  33
3  44

In [35]:
dict1={'ID':[11,22,33,44], 'SN':[1,2,3,4]}
dict1

{'ID': [11, 22, 33, 44], 'SN': [1, 2, 3, 4]}

In [36]:
df4=pd.DataFrame(dict1)
df4

   ID  SN
0  11   1
1  22   2
2  33   3
3  44   4

In [37]:
dict1={'ID':[11,22,33,44], 'SN':[1,2,3,4], 'Name':['a','s','d','f']}
dict1

{'ID': [11, 22, 33, 44], 'SN': [1, 2, 3, 4], 'Name': ['a', 's', 'd', 'f']}

In [38]:
df5=pd.DataFrame(dict1)
df5

   ID  SN Name
0  11   1    a
1  22   2    s
2  33   3    d
3  44   4    f

In [39]:
ls=[{'a':1, 'b':2},{'a':3, 'b':4}]
df6=pd.DataFrame(ls)
df6

   a  b
0  1  2
1  3  4

In [40]:
ls=[{'a':1, 'b':2},{'a':3, 'b':4, 'c':5}]
df6=pd.DataFrame(ls)
df6

   a  b    c
0  1  2  NaN
1  3  4  5.0

In [41]:
dict_1={'ID': pd.Series([1,2,3]), 'SN':[111,222,333]}
df7=pd.DataFrame(dict_1)
df7

   ID   SN
0   1  111
1   2  222
2   3  333

# How to read CSV file

In [19]:
import pandas as pd

In [20]:
df = pd.read_csv('second.csv')
df

   ID   Name  Physics  Chemistry  Math  Total    Percent
0   1  Arohi       45         52    49    146  48.666667
1   2  Anita       57         50    55    162  54.000000
2   3  Suman       54         59    51    164  54.666667
3   4  Rahul       76         67    49    192  64.000000
4   5  Sunil       89         61    71    221  73.666667
5   6  Varun       74         59    56    189  63.000000

In [21]:
df = pd.DataFrame({'ID':[3,4],
                  'Name': ['c','d'],
                  'Class': [7,8]})
df

   ID Name  Class
0   3    c      7
1   4    d      8

In [22]:
df1 = pd.DataFrame({'ID':[1,2,3,4],
                  'Name': ['a','b','c','d'],
                  'Class': [5,6,7,8]})
df1

   ID Name  Class
0   1    a      5
1   2    b      6
2   3    c      7
3   4    d      8

In [23]:
pd.concat([df1,df], axis = 1)

   ID Name  Class   ID Name  Class
0   1    a      5  3.0    c    7.0
1   2    b      6  4.0    d    8.0
2   3    c      7  NaN  NaN    NaN
3   4    d      8  NaN  NaN    NaN

In [24]:
pd.concat([df1,df], axis = 1, join_axes = [df.index])

TypeError: concat() got an unexpected keyword argument 'join_axes'

## Again

In [1]:
import pandas as pd

In [9]:
a=pd.Series[1,2,3,4]
b=pd.Series[2,3,4,5]
c=a+b
print(c)
d=a-b
print(d)
e=a*b
print(e)
f=a/b
print(f)

TypeError: 'type' object is not subscriptable

In [12]:
a=[[1,2,3,4,5],[8,9,6,5,8],[2,4,7,9,5]]
df=pd.DataFrame(a)
df

   0  1  2  3  4
0  1  2  3  4  5
1  8  9  6  5  8
2  2  4  7  9  5

In [18]:
dict_a={'ID': [2,3,5,6], 'Name':['A','B','C','D'], 'Course':['Python','ML','AI','ML']}
df = pd.DataFrame(dict_a)
df

   ID Name  Course
0   2    A  Python
1   3    B      ML
2   5    C      AI
3   6    D      ML

In [16]:
dict_a={'ID': (2,3,5,6), 'Name':('A','B','C','D'), 'Course':('Python','ML','AI','ML')}
df = pd.DataFrame(dict_a)
df

   ID Name  Course
0   2    A  Python
1   3    B      ML
2   5    C      AI
3   6    D      ML